; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	Star2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation8 - direction
	Star6 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star7 - direction
	Star10 - direction
	GroundStation9 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation9)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star10)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet15)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation9)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(pointing satellite0 Star16)
	(pointing satellite1 Planet12)
	(pointing satellite2 Star16)
	(have_image Star11 spectrograph2)
	(have_image Planet12 spectrograph2)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
	(have_image Planet15 spectrograph2)
	(have_image Star16 spectrograph2)
))

)

; plan
1. (turn_to satellite3 groundstation9 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 groundstation9)
   goals met: 1 of 9
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 9
3. (calibrate satellite3 instrument6 groundstation9)
   added: (calibrated instrument6)
   goals met: 1 of 9
4. (turn_to satellite3 planet15 groundstation9)
   deleted: (pointing satellite3 groundstation9)
   added: (pointing satellite3 planet15)
   goals met: 1 of 9
5. (take_image satellite3 planet15 instrument6 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 2 of 9
6. (turn_to satellite3 planet12 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet12)
   goals met: 2 of 9
7. (take_image satellite3 planet12 instrument6 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 3 of 9
8. (turn_to satellite3 phenomenon14 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon14)
   goals met: 3 of 9
9. (turn_to satellite2 star16 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 star16)
   goals met: 4 of 9
10. (turn_to satellite0 star16 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star16)
   goals met: 5 of 9
11. (take_image satellite3 phenomenon14 instrument6 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 6 of 9
12. (turn_to satellite3 star11 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star11)
   goals met: 6 of 9
13. (take_image satellite3 star11 instrument6 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 7 of 9
14. (turn_to satellite3 star13 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star13)
   goals met: 7 of 9
15. (take_image satellite3 star13 instrument6 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 8 of 9
16. (turn_to satellite3 star16 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star16)
   goals met: 8 of 9
17. (take_image satellite3 star16 instrument6 spectrograph2)
   added: (have_image star16 spectrograph2)
   goals met: 9 of 9
